package foo.lesson;

public class Lesson20161104 {
   /**
    * 
    * 
    0.ORM框架是什么东西？WEBMVC框架是什么东西？
	1.Spring框架是什么东西？为什么要使用他？他有什么优点，缺点？他有哪几个主要特性？
	2.Hibernate是什么东西？为什么要使用他？他有什么优点，缺点？他有哪几个主要特性？
	3.Struts2是什么东西？为什么要使用他？他有什么优点，缺点？他有哪几个主要特性？
	4.JSON和XML有什么区别？要怎么解析他么？
	  XML有几种解析格式？
	  JSON常见的解析包？
	5.Servlet是什么？他是干什么的？为什么要使用他？
	6.JSP是什么？他是干什么的？为什么要使用他？
	7.Struts2是怎么配置的？
	8.Spring是怎么配置的？
	9.Hibernate是怎么配置的?
	10.Tomcat是什么东西？为什么要使用他？他有什么优点，缺点？有哪几个主要特征？
	11.Mysql是什么东西？为什么要使用他？他有什么优点，缺点？
	12.简单的数据库优化有哪些方案？
	13.事务是什么东西？为什么要使用他？他有什么优点，缺点？
	14.Tomcat是如何配置Servlet的？Tomcat配置需要注意哪些方面？
	15.为什么要使用SSH框架？有其他的替代方案吗？
	16.HTML/css/jAVASCRIPT各是什么东西，为什么要使用它们？
	17.Maven是什么东西？他有什么用处？为什么要使用他？
	18.SVN是什么东西？他有什么用处？为什么要使用他？
	19.编程中遇到问题了 你是怎么解决问题的？
	20.你为什么要学习JAVA？他有什么特性？他的优点和缺点？
	21.常见的数据库有哪些？它们有什么优点缺点？
	22.你有用过哪些第三方库，为什么要使用它们？
	23.SSH框架一般会使用哪些第三方服务和中间件？
	24.XML配置和注解有什么不同？各有什么好处？
	25.你知道怎么用Spring注解来配置依赖注入吗？
	26.一个WEBAPP的文件结构大概是什么样子的？(类放在哪里，页面放在哪里？配置文件放在哪里？)
	27.描述一下一个WEBAPP是怎么跑起来的
	28.描述一下从浏览器请求到后台再显示页面回前台的整个过程？中间经历了哪些?
	29.Hibernate的三个状态是什么？他们之间怎么互相转化的
	30.Hibernate的一级缓存，二级缓存，三级缓存。
	31.怎么独立把SSH框架架构起来
	32.一般WEB程序分哪几个层？为什么要这么分层
	33.怎么做单元测试？一般用什么做单元测试
	34.说说日记相关的jar包
	35.说说常用的数据库连接池
	36.说说常用的缓存
	37.分页算法
	38.Hibernate常见的优化
	39.什么是SQL注入
	40.Statement和PrepareedStatement的区别
	41.怎么实现依赖注入DI
	42.怎么实现AOP？
	43.解释一下AOP编程？
	44.谈谈AOP中的Jointpoint,pointcut,advice,Aspect等概念
	45.Spring的自动装配机制
	46.怎么组织语言把你所学的写到你的项目中去？
	
	
    */
}
