package foo.lesson.summary;

/**
 * <b>编程相关的技能</b><p>
 * 
 * <b>相关的技术网站/社区/BLOG:</b><br>
 * 1.[CSDN] : http://bbs.csdn.net/home
 * 2.[GitHub] : https://github.com/ 
 * 
 * <b>职业素养</b>
 * 
 * 1.个人形象（一旦你达标了他就不关键了）
 * 2.性格(开朗大方,不要把压力积存在心里,释放)
 * 3.不要散发负能量
 * 4.PPT，你们的演讲能力(低调做人，高调做事)
 * 5.工作中，上班途中，长辈 尽量打招呼
 * 6.反对别人之前先肯定对方。（不要贸然贬低对方）
 * 7.交浅言深
 * 
 * 对社会做一定的调整()
 * 
 * 1.入职了你们对这个公司不满意?<br>
 * 2.怎么跨过社会招聘要有XXX年工作经验?<br>
 * 
 * <b>演讲</b>
 * 1.说话音量小(不要含着说话)
 * 2.常见的英文单词说准确点(面试官可能会突然没反应过来你在讲什么)【讲完英文单词把中文意思复述一遍】
 * 3.拘谨（注意力不集中）(杂念太多)
 * 4.表述过于简单,(没有表述技术细节 servlet就是可以处理动态网络资源（一定要把怎么处理的讲出来）)
 * 5.条理性（技术脉络）
 * 
 * 
 * #问到你不会的问题你要怎么处理?（观察你人的反应）
 * 1.不慌（脑子清楚）
 * 2.反问(争取时间理清思路)
 * 3.实在想不起来 略过当前问题（将精力集中到下面的问题）
 * 
 * <b>知识管理</b>
 * 1.Pocket的（ReadLater）以后再读，网页页签【保存下来以后我再去读他】
 * 2.印象笔记（有道笔记）：分类管理你们的一些知识
 * 3.整理你们的网页收藏夹
 * 4.脑图（动笔记录你们的碎片化知识）
 * 5.看书（作者出书的频率，一年出一本不可能是好书）
 * 
 * <b>就业</b><p>
 * 1.实习期 国家规定最多6个月，一般以3个月为准  <p>
 * 2.福建地区未毕业的算实体 薪资会被压低一半左右 <p>
 * 3.一旦有些事情看上去过于美好（就要多长点心眼）<p>
 * 4.商业借贷,信用卡机制过于发达(控制你们的欲望)<p>
 *  
 * <b>常用软件</b><br>
 * 1.IDE:Eclipse/MyEclipse/IntelliJ
 * 2.多人协作-版本控制: Git/SVN/CVS
 * 3.文本编辑器:Editplus/SublimeText3
 * 4.文档编写/统计图:word/markdown/ppt/(keynote)/Excel
 * 5.UML画图:RoseRational/StarUML
 * 6.浏览器:Chrome/FireFox
 * 7.vpn:Google/Github/
 * 8.数据库相关:PLSQL/Navicat
 * 
 * 
 * <b>知识收集,碎片知识</b>
 * 0.手机的知识点：记录一些简单的点
 * 1.Pocket： readLater 收集网页的页签
 * 2.印象笔记: 个人知识整理
 * 2-2.注册个google的账号：管理你的收藏夹
 * 3.MOOC在线课程(入门):网易云课堂/Coursra(创始人 百度AI部门BaiduMind 吴恩达)
 * 4.学习网站/技术社区:github,stackoverflow,CSDN,一些UGC社区知乎,Quora
 * 5.善于使用搜索:1.有一定专业词汇单词量  2.搜索技巧
 * 6.脑图(百度脑图):定期整理你的知识脉络
 * 7.学好英文:
 * 
 * 10.编程语言相关书籍(能写程序):EffectiveJava / SQL必知必会  / 图解TCP/IP / 鸟哥的Linux私房课
 * 11.程序设计相关书籍(能写好程序): java并发编程实战 / 深入理解Java虚拟机
 * 12.计算机底层相关书籍(能做到别人做不到的):深入理解计算机系统
 * 13.计算机理论相关书籍(大神):
 * 
 * <b>简历</b>
 * //0.好的简历排版
 * //1.简历的准备细节
 * //#好的简历只是让你获得一次面试机会.
 * //简历名称: 你的名字+应聘职位
 * //简历内容包含应聘岗位的关键字（便于他们搜索）
 * //2.简历的内容
 * //#项目导向,#你写进去一定要能讲出来
 * //在你的项目里面突出你所掌握的技术点
 * //你WEB的工程要放在最前面，最醒目的地方
 * //1.技术点和(技术细节) / 容易影响WEB性能的地方
 * //2.你遇到了哪些问题?你是怎么解决的?
 * //3.
 *  //需求分析:UML(软件：StarUML,Rose  图例:类图,时序图) - 需求文档(Doc/MarkDown)
 *  //代码实现:
 *  //1.数据库建库建表(Mysql(主流数据库库区别?)/Navicat)/建表要注意的地方(主键的两种方式:自增长/UUID,数据库乱码)
 *  //2.Junit单元测试(整合了Spring的单元测试)
 *  //3.Spring/SpringMVC/ORM框架:如何搭建三大框架
 *  //4.为什么要选择Spring框架?
 *  //5.为什么要选择SpringMVC框架?
 *  //6.为什么要选择ORM框架?
 *  
 *  
 *  //7.产品的模块划分:讲一下项目整体的模块划分，重点讲一下你负责的模块
 *  //商城模块 - 
 *  //手机端/前端显示:
 *  
 *  //#购物车模块:
 *  //#网络支付模块:理解以下数字签名
 *  //#权限管理模块:
 *  (Apache Shiro 
 *  数据库分表 / 
 *  权限表Menu
 *  /角色表Role
 *  /User用户表
 *  /user_role 
 *  /role_menu
 *  )
 *  //细粒度的权限机制/
 *  //登录密码双重加密
 *  
 *  //#菜单管理模块:
 *  //#工作流模块/oa模块:
 *  
 *  //内容管理模块: 
 *  //文章管理-
 *  //(BooStrap页面美化/
 *  /树形表格界面ZTree/CKEditor富文本/Ckfinder上传组件/SiteMesh布局框架)
 *  //统一用到的：验证框架/权限管理
 *  
 *  //
 *  //留言管理模块
 *  
 *  //8.用Maven进行项目管理
 *  
 * @author wyy
 * 2016年12月9日
 *
 */
public class LessonSummary {
  //<b>职业素养</b>
  /**
   * 1.入职了你们对这个公司不满意?
   */
	//1.有问题先沟通(把你手头的工作交接好，提前通知对方) : 对公司的保障
	//2.不建议裸辞（做好两手准备）                                             : 对你自己的保障
   /**
    * 2.就业季最旺盛的时候？	
    */
	//三月（流动最旺盛的时候）和七月（竞争最激烈）
   /**
    * 3.面试前的准备和面试后的准备?
    */
	//一定要做总结，一次比一次好
	/**
	 * 4.跨专业 或者 本专业专业能力比较差的那种?竞争力？
	 */
	//1.为人处事 口才
	//2.专业知识
	//3.面对挫折的能力(如果几个人一起去，有人通过有人没通过怎么调整你的心态)
	//(能力有强有弱，有些人可能会很快找到很好的工作。有些人可能需要一定时间)
	/**
	 * 5.有问题一定要及时沟通？（工作中也是一样，尽量不要自己闷头干，多请教别人）
	 */
	//多请教别人
	//1.节省你自己的时间，避免走弯路
	//2.请教别人（别人会有一种成就感）
	//3.显得你积极向上（比你自己闷头不知道在干吗要强很多）
	//4.拓展你在公司的人脉关系的一个途径
	
	/**
	 * 2.怎么跨过社会招聘要有XXX年工作经验?<br>
	 */
	//#1-2年经验大胆投
	//#为什么要求你有工作经验?
	//筛选一部分人
	//填过得坑越多你工作经验越丰富.
	//混一些技术社区,吸收别人解决问题的方法和方式。汇总别人的经验你要用自己的话表达出来。
	//#胆大心细
	//#多关注一些乔布斯,张小龙，雷军等传奇或者传奇产品微信等的发展历程.
	/**
	 * 你工作中遇到哪些问题，你怎么解决的?
	 */
}
